Pandas

In [10]:
import pandas as pd
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1) 
internal2={'s1':30,'s2':20,'s3':10}
internal2=pd.Series(internal2)
print(internal2)

s1    20
s2    10
s3    30
dtype: int64
s1    30
s2    20
s3    10
dtype: int64

In [9]:
final={'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
final

    Internal1  Internal2
s1         20         30
s2         10         20
s3         30         10

In [11]:
final.columns

Index(['Internal1', 'Internal2'], dtype='object')

In [12]:
  final.values

array([[20, 30],
       [10, 20],
       [30, 10]], dtype=int64)

In [15]:
final.values[1,0]

10

In [16]:
for i in final.values:
    print(i[0],i[1])

20 30
10 20
30 10

In [17]:
final.loc['s4']=[20,30]

In [18]:
final

    Internal1  Internal2
s1         20         30
s2         10         20
s3         30         10
s4         20         30

In [19]:
final.drop('s3')

    Internal1  Internal2
s1         20         30
s2         10         20
s4         20         30

In [22]:
final.values[1]=[23,43]

In [23]:
final

    Internal1  Internal2
s1         20         30
s2         23         43
s3         30         10
s4         20         30

In [76]:
import pandas as pd
income=pd.read_csv('income.csv')
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [85]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [30]:
for i in income.values:
    print(i[1],"   ",i[10])

Alabama     41381
Alaska     61137
Arizona     50602
Arkansas     39919
California     57528

In [35]:
s=0 
for i in range(2,11):
    s+=income.values[2][i]
print(s)

424933

In [38]:
##Alaska average

s=0 
for i in range(2,11):
    s+=income.values[1][i]
print(s//9)

60106

In [80]:
##2012 average income
income.loc[:,"2012"].mean()

50038.8

In [92]:
#average income of all states
income.mean()

2005    45339.8
2006    46680.6
2007    49789.8
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [93]:
##function to create column in single line
def showColumn():
        return income.columns
showColumn()

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [91]:
#row based column value

row=int(input())
ic=0
for i in income.values:
    if row==ic:
        print(i)
    ic=ic+1

0
['04000US01' 'Alabama' 37150 37952 42212 44476 39980 40933 42590 43464
 41381]

In [96]:
def highest_income():
    s=0
    s1=0
    s2=0
    k = 0
    for i in income.values:
        s = s +i[8]
        s1 = s1 +i[9]
        s2 =s2+i[10]
        k = k+1
    j=max(s/k,s1/k,s2/k)
    print(j)
highest_income()

50113.4

In [97]:
def lowest_income():
    s=0
    s1=0
    s2=0
    s3=0
    k=0
    for i in income.values:
        s=s+i[4]
        s1=s1+i[5]
        s2=s2+i[6]
        s3=s3+i[7]
        k=k+1
    j=min(s/k,s1/k,s2/k,s3/k)
    print(j)
lowest_income()

47709.4